Repository: ybray968/black-rock-yellow-sands-website
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Premium Plywood Construction Materials
ar: مواد البناء من الخشب الرقائقي الفاخر

source: Home
ar: الرئيسية

source: Products
ar: المنتجات

source: About
ar: نبذة عنا

source: Contact
ar: اتصل بنا

source: Search products...
ar: ابحث عن المنتجات...

source: Premium Birch Plywood & Construction Materials Wholesale
ar: الخشب الرقائقي البتولا الفاخر ومواد البناء بالجملة

source: Construction Materials & Agricultural Commodities Wholesale
ar: مواد البناء والسلع الزراعية بالجملة

source: Discover our extensive collection of high-quality construction materials and premium agricultural commodities including wheat grain, barley, soybean, and sulfur.
ar: اكتشف مجموعتنا الواسعة من مواد البناء عالية الجودة والسلع الزراعية الممتازة بما في ذلك حبوب القمح والشعير وفول الصويا والكبريت.

source: Agricultural Commodities
ar: السلع الزراعية

source: Premium wheat grain, barley, soybean, and sulfur
ar: حبوب القمح والشعير وفول الصويا والكبريت الممتازة

source: Wheat
ar: القمح

source: Barley
ar: الشعير

source: Soybean Meal
ar: وجبة فول الصويا

source: Sulfur
ar: الكبريت

source: Sultanate of Oman
ar: سلطنة عمان

source: Plywood
ar: الخشب الرقائقي

source: Company
ar: الشركة

source: About Us
ar: نبذة عنا

source: Careers
ar: الوظائف

source: Blog
ar: المدونة

source: Contact Info
ar: معلومات الاتصال

source: Muscat
ar: مسقط

source: Sidab
ar: سيداب

source: Thank you for your message! We will get back to you soon.
ar: شكراً لك على رسالتك! سنتواصل معك قريباً.

source: Sunday
ar: الأحد

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Closed
ar: مغلق

source: CR:
ar: رقم التسجيل:

source: VATIN:
ar: الرقم الضريبي:

source: All rights reserved.
ar: جميع الحقوق محفوظة.

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Service
ar: شروط الخدمة

source: About Black Rock And Yellow Sands International
ar: حول شركة الصخرة السوداء والرمال الصفراء الدولية

source: Who We Are
ar: من نحن

source: Black Rock And Yellow Sands International is a wholesale supplier of construction plywood of extreme quality, meeting all emission standards, especially for formaldehyde.
ar: شركة الصخرة السوداء والرمال الصفراء الدولية هي مورد بالجملة للخشب الرقائقي للبناء بجودة فائقة، تلبي جميع معايير الانبعاثات، وخاصة للفورمالديهايد.

source: Our clients are contractors, construction professionals, and manufacturers who demand top-quality plywood for their projects. We understand that in professional construction and manufacturing, material quality is non-negotiable.
ar: عملاؤنا هم مقاولون ومحترفو بناء ومصنعون يطالبون بخشب رقائقي عالي الجودة لمشاريعهم. نحن نفهم أنه في البناء والتصنيع المهني، جودة المواد غير قابلة للتفاوض.

source: Our Vision
ar: رؤيتنا

source: To be the preferred wholesale supplier of premium construction plywood for professionals who demand uncompromising quality and reliable supply chains.
ar: أن نكون المورد المفضل بالجملة للخشب الرقائقي الممتاز للمحترفين الذين يطالبون بجودة لا تقبل المساومة وسلاسل توريد موثوقة.

source: Our Mission
ar: مهمتنا

source: To deliver consistent, high-quality construction plywood that meets professional standards, with reliable supply chains and competitive wholesale pricing.
ar: تقديم خشب رقائقي للبناء عالي الجودة ومتسق يلبي المعايير المهنية، مع سلاسل توريد موثوقة وأسعار جملة تنافسية.

source: What Sets Us Apart
ar: ما يميزنا

source: CARB Compliant
ar: متوافق مع معايير CARB

source: All emission standards met
ar: جميع معايير الانبعاثات مستوفاة

source: Wholesale Focus
ar: تركيز على الجملة

source: Volume pricing for professionals
ar: أسعار الكميات للمحترفين

source: Quality Control
ar: مراقبة الجودة

source: Extreme quality standards
ar: معايير جودة فائقة

source: Professional Grade
ar: درجة مهنية

source: For contractors & manufacturers
ar: للمقاولين والمصنعين

source: Contact Us
ar: اتصل بنا

source: Contact Black Rock And Yellow Sands International
ar: تواصل مع شركة الصخرة السوداء والرمال الصفراء الدولية

source: Get in touch with our team for quotes, product information, or any questions about our wood materials.
ar: تواصل مع فريقنا للحصول على أسعار، معلومات عن المنتجات، أو أية أسئلة حول مواد الخشب لدينا.

source: Visit Our Showroom
ar: زر معرضنا

source: Sultanate of Oman, Muscat
ar: سلطنة عمان، مسقط

source: Business Hours
ar: ساعات العمل

source: Sunday - Friday: 8:00 - 18:00
ar: الأحد - الجمعة: 8:00 - 18:00

source: Saturday: Closed
ar: السبت: مغلق

source: Call Us
ar: اتصل بنا

source: Send Us a Message
ar: أرسل لنا رسالة

source: Full Name
ar: الاسم الكامل

source: Email Address
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Subject
ar: موضوع الرسالة

source: Select a subject
ar: اختر موضوعًا

source: Request a Quote
ar: طلب تسعير

source: Product Information
ar: معلومات المنتج

source: Delivery Inquiry
ar: استفسار عن التوصيل

source: Customer Support
ar: دعم العملاء

source: Other
ar: غير ذلك

source: Message
ar: الرسالة

source: Max 1000 characters, no links allowed
ar: أقصى 1000 حرف، الروابط غير مسموح بها

source: Please provide details about your inquiry. Note: Links and URLs are not allowed in messages.
ar: يرجى تقديم تفاصيل حول استفسارك. ملاحظة: الروابط وعناوين URL غير مسموح بها في الرسائل.

source: characters
ar: حرف

source: Links not allowed
ar: الروابط غير مسموحة

source: I am a human and not a robot
ar: أنا إنسان ولست روبوت

source: Please check this box to verify that you are human
ar: يرجى تحديد هذا الصندوق للتحقق من أنك إنسان

source: Send Message
ar: إرسال الرسالة

source: Need Immediate Assistance?
ar: تحتاج مساعدة فورية؟

source: Our sales team is ready to help you find the perfect wood materials for your project.
ar: فريق المبيعات لدينا جاهز لمساعدتك في العثور على المواد الخشبية المثالية لمشروعك.

source: Call Now
ar: اتصل الآن

source: Email Business
ar: أرسل بريدًا للأعمال

source: Discover our extensive collection of high-quality plywood construction materials. Perfect for construction professionals, contractors and manufacturers.
ar: اكتشف مجموعتنا الواسعة من مواد البناء من الخشب الرقائقي عالية الجودة. مثالية لمحترفي البناء والمقاولين والمصنعين.

source: Browse Products
ar: تصفح المنتجات

source: Get Quote
ar: احصل على عرض سعر

source: Discover Products
ar: اكتشف المنتجات

source: Versatile building materials for construction
ar: مواد بناء متعددة الاستخدامات للبناء

source: Featured Products
ar: المنتجات المميزة

source: View Details
ar: عرض التفاصيل

source: View All Products
ar: عرض كل المنتجات

source: Why Choose Black Rock And Yellow Sands International?
ar: لماذا تختار شركة الصخرة السوداء والرمال الصفراء الدولية؟

source: Premium Quality
ar: جودة فائقة

source: Carefully selected materials that meet the highest industry standards.
ar: مواد مختارة بعناية تلبي أعلى معايير الصناعة.

source: Formaldehyde emission level is absolutely safe for human health and the environment.
ar: مستوى انبعاث الفورمالديهايد آمن تماماً لصحة الإنسان والبيئة.

source: Fast Delivery
ar: توصيل سريع

source: Quick manufacturing and reliable delivery to keep your projects on schedule.
ar: تصنيع سريع وتوصيل موثوق للحفاظ على مواعيد مشاريعك.

source: Expert Support
ar: دعم خبراء

source: Professional guidance from our experienced team.
ar: إرشاد مهني من فريقنا ذو الخبرة.

source: Ready to Start Your Project?
ar: جاهز لبدء مشروعك؟

source: Get in touch with our experts for personalized recommendations and competitive pricing.
ar: تواصل مع خبرائنا للحصول على توصيات شخصية وأسعار تنافسية.

source: Browse Catalog
ar: تصفح الكتالوج

source: Durability Testing
ar: اختبار المتانة

source: Plywood grades
ar: درجات الخشب الرقائقي

source: 1 (B) grade
ar: الدرجة 1 (B)

source: 1 (B) grade is almost without defects, only a few sound knots with a diameter of up to 15 mm are allowed
ar: الدرجة 1 (B) تكاد تكون خالية من العيوب، يُسمح فقط ببعض العقد الصوتية بقطر يصل إلى 15 مم

source: 2 (BB) grade
ar: الدرجة 2 (BB)

source: 2 (BB) grade allows patches on the surface of the sheet. Knots and open defects are repaired with veneer inserts
ar: الدرجة 2 (BB) تسمح بالرقع على سطح الصفيحة. تُصلح العقد والعيوب المفتوحة بإدخالات قشرة

source: 3 (CP) grade
ar: الدرجة 3 (CP)

source: 3 (CP) grade allows partly accrete, single and loose knots with a diameter of no more than 6 mm in the amount of 10 pcs. per 1 m² of the sheet surface
ar: الدرجة 3 (CP) تسمح بالعقد الملتصقة جزئيًا والعقد الفردية والحرة بقطر لا يزيد عن 6 مم بكمية 10 قطع لكل متر مربع من سطح الصفيحة

source: 4 (C) grade
ar: الدرجة 4 (C)

source: 4 (C) grade allows many manufacturing defects, a strong gluing is guaranteed
ar: الدرجة 4 (C) تسمح بالعديد من العيوب التصنيعية، يضمن اللصق القوي

source: Plywood Deck – Taber Test results (Durability)
ar: خشب رقائقي Deck – نتائج اختبار Taber (المتانة)

source: Machine:
ar: الآلة:

source: Taber Model 503
ar: طراز Taber 503

source: Method:
ar: الطريقة:

source: determination of coating abrasion resistance
ar: تحديد مقاومة الطلاء للتآكل

source: Samples received:
ar: العينات المستلمة:

source: 25th July 2024
ar: ٢٥ يوليو ٢٠٢٤

source: Date of testing:
ar: تاريخ الاختبار:

source: 7th August 2024
ar: ٧ أغسطس ٢٠٢٤

source: Product:
ar: المنتج:

source: Birch Plywood covered with thermal reactive filming, thickness 18mm, coating density 120g/m2
ar: خشب بتولا مغطى بطبقة تصوير حراري، سمك ١٨مم، كثافة الطلاء ١٢٠غ/م٢

source: Taber Test Machine
ar: آلة اختبار Taber

source: Series, sample #
ar: السلسلة، العينة #

source: Number of turns
ar: عدد الدوران

source: Coating abrasive resistance
ar: مقاومة الطلاء للتآكل

source: (IP), coating begins to wear off
ar: (IP)، يبدأ الطلاء في التآكل

source: (FP), coating completely wears off
ar: (FP)، يزول الطلاء تماماً

source: Z = (IP + FP)/2 * f, number of table turns
ar: Z = (IP + FP)/2 * f، عدد دورانات الطاولة

source: The overall look after abrasion test
ar: المظهر العام بعد اختبار التآكل

source: Correction factor f = 0.87
ar: عامل التصحيح f = 0.87

source: Our Products
ar: منتجاتنا

source: product
ar: منتج

source: found
ar: تم العثور عليها

source: Applications
ar: التطبيقات

source: In Stock
ar: متوفر في المخزون

source: Out of Stock
ar: غير متوفر في المخزون

source: Moderately dangerous in terms of toxicity of combustion products
ar: متوسطة الخطورة من حيث سمية منتجات الاحتراق

source: Moderate smoke-generating capacity
ar: سعة توليد دخان معتدلة

source: Inflame-resistant and low flammable
ar: مقاومة للاشتعال وقابلة للاشتعال المنخفض

source: Advanced fire safety properties
ar: خصائص أمان حرائق متقدمة

source: Exceptional Sound-insulation properties
ar: خصائص عزل صوتي استثنائية

source: Moderately dangerous in terms of toxicity
ar: متوسطة الخطورة من حيث السمّية

source: Safe combustion products
ar: منتجات احتراق آمنة

source: Controlled smoke emission
ar: انبعاثات دخان محكومة

source: Excellent capacity to hold fasteners
ar: قدرة ممتازة على تثبيت المشابك

source: Superior fastening and assembly capabilities
ar: قدرات تثبيت وتجميع فائقة

source: Possibility of deep imprints
ar: إمكانية عمل طبعات عميقة

source: Advanced surface texturing capabilities
ar: قدرات نسيج سطحي متقدمة

source: Decorative antislip surface
ar: سطح زخرفي مضاد للانزلاق

source: Hexagonal pattern combining beauty and function
ar: نمط سداسي يجمع بين الجمال والوظيفة

source: Resistance to environmental conditions
ar: مقاومة لظروف البيئة

source: Mechanical damage resistance
ar: مقاومة الأضرار الميكانيكية

source: High load-bearing capacity
ar: قدرة تحمل أحمال عالية

source: Transport industry and construction applications
ar: تطبيقات صناعة النقل والبناء

source: Resistant to the impact of roller wheels
ar: مقاوم لتأثير العجلات المدحرجة

source: Material handling equipment protection
ar: حماية معدات مناولة المواد

source: Maximum slip resistance
ar: الحد الأقصى لمقاومة الانزلاق

source: MT-mesh antislip surface for safety
ar: سطح مضاد للانزلاق من الشبكة MT للأمان

source: Heavy-duty commercial transport applications
ar: تطبيقات النقل التجاري الثقيل

source: High strength and durability
ar: قوة ومتانة عالية

source: Enhanced strength properties with solid veneer option
ar: خصائص قوة محسنة مع خيار القشرة الصلبة

source: Resistance to moisture impact
ar: مقاومة تأثير الرطوبة

source: Improved moisture resistance for flooring applications
ar: مقاومة رطوبة محسنة لتطبيقات الأرضيات

source: Special thickness tolerances
ar: تحمل سمك خاص

source: Strict thickness control for parquet manufacturing
ar: تحكم صارم في السمك لتصنيع الباركيه

source: Complete absence of healthy color changes
ar: غياب تام لتغيرات الألوان الصحية

source: Consistent color quality in B and BB grades
ar: جودة لون ثابتة في درجات B و BB

source: Safe for human health
ar: آمن لصحة الإنسان

source: Low formaldehyde emission levels
ar: مستويات انبعاث فورمالديهايد منخفضة

source: Environmentally friendly
ar: صديق للبيئة

source: Sustainable forestry practices
ar: ممارسات غابات مستدامة

source: Light weight
ar: وزن خفيف

source: Easy handling and installation
ar: سهولة التعامل والتركيب

source: Beautiful birch texture
ar: نسيج بتولا جميل

source: Natural wood grain appearance
ar: مظهر حبيبات الخشب الطبيعي

source: Resistance to moisture impact and UV-radiation
ar: مقاومة تأثير الرطوبة والأشعة فوق البنفسجية

source: Enhanced protection against environmental factors
ar: حماية محسنة ضد العوامل البيئية

source: Wear-resistant decorative surface of birch veneer
ar: سطح زخرفي مقاوم للتآكل من قشرة البتولا

source: Durable surface layer for decorative applications
ar: طبقة سطحية متينة للتطبيقات الزخرفية

source: Natural wood aesthetics
ar: جماليات الخشب الطبيعي

source: Beautiful natural birch appearance
ar: مظهر بتولا طبيعي جميل

source: Easy to maintain
ar: سهل الصيانة

source: Simple cleaning and maintenance requirements
ar: متطلبات تنظيف وصيانة بسيطة

source: Strength and durability
ar: القوة والمتانة

source: Ultra-durable birch plywood for construction
ar: خشب رقائقي بتولا فائق المتانة للبناء

source: High resistance to surface abrasion
ar: مقاومة عالية لتآكل السطح

source: Taber Test proven durability
ar: متانة مثبتة باختبار تابير

source: Increased water-resistance
ar: مقاومة متزايدة للماء

source: Wide range of film colors and densities
ar: مجموعة واسعة من ألوان وكثافات الأفلام

source: We are proud of our plywood durability. Our plywood regularly undergoes durability and abrasion tests in lab and on site. Click on the button below to view durability test results and learn more about our plywood
ar: نحن فخورون بمتانة الخشب الرقائقي لدينا. يخضع خشبنا الرقائقي بانتظام لاختبارات المتانة والتآكل في المختبر وفي الموقع. انقر على الزر أدناه لعرض نتائج اختبار المتانة ومعرفة المزيد عن خشبنا الرقائقي

source: View Taber Test Results
ar: عرض نتائج اختبار تابير

source: Excellent bonding properties
ar: خصائص اتصال ممتازة

source: Superior adhesive compatibility
ar: توافق لاصق فائق

source: WBP grade waterproof performance
ar: أداء مقاوم للماء بدرجة WBP

source: Exceptional durability
ar: متانة استثنائية

source: Long-lasting performance in harsh conditions
ar: أداء طويل الأمد في ظروف قاسية

source: Easy to use and process
ar: سهل الاستخدام والمعالجة

source: Excellent machinability and finishing
ar: قابلية تشغيل وإنهاء ممتازة

source: Technical Specifications
ar: المواصفات الفنية

source: No products found
ar: لم يتم العثور على منتجات

source: Try adjusting your filters or search terms.
ar: جرب تعديل المرشحات أو شروط البحث.

source: Filter Products
ar: تصفية المنتجات

source: Search
ar: بحث

source: Category
ar: الفئة

source: All Categories
ar: جميع الفئات

source: Wood Type
ar: نوع الخشب

source: All Types
ar: جميع الأنواع

source: Wood Species
ar: أنواع الخشب

source: All Species
ar: جميع الأنواع

source: Sort By
ar: ترتيب حسب

source: Name A-Z
ar: الاسم من أ إلى ي

source: Price: Low to High
ar: السعر: من الأقل إلى الأعلى

source: Price: High to Low
ar: السعر: من الأعلى إلى الأقل

source: Newest First
ar: الأحدث أولاً

source: Apply Filters
ar: تطبيق المرشحات

source: Clear All
ar: مسح الكل

source: Material
ar: المواد

source: Try adjusting your search criteria or browse all products.
ar: حاول تعديل معايير البحث أو تصفح جميع المنتجات.

source: Back to Home
ar: العودة إلى الرئيسية

source: 95% of image erased
ar: تم مسح 95% من الصورة

source: 95% of the image was erased
ar: تم مسح 95% من الصورة

source: Image mostly erased
ar: تم مسح معظم الصورة

source: 95 percent of image erased
ar: تم مسح 95 في المئة من الصورة

source: 95 percent of the image was erased
ar: تم مسح 95 في المئة من الصورة

source: On average, Plywood Deck can be used in 50 cycles of cement pouring
ar: في المتوسط، يمكن استخدام الخشب الرقائقي الدك في 50 دورة من صب الأسمنت

source: Perfect surface for neat and easy painting
ar: سطح مثالي للطلاء الأنيق والسهل

source: Smooth melamine film base ready for any color
ar: قاعدة فيلم الميلامين الناعمة جاهزة لأي لون

source: Saving time and paint materials
ar: توفير الوقت ومواد الطلاء

source: Pre-primed surface reduces preparation work
ar: السطح المُعد مسبقاً يقلل من أعمال التحضير

source: Wear-resistant surface without cracks
ar: سطح مقاوم للتآكل بدون شقوق

source: Durable melamine film coating
ar: طلاء فيلم الميلامين المتين

source: Easy painting and lacquering without any treatment
ar: طلاء ولاكيه سهل بدون أي معالجة

source: No primer or base coat required
ar: لا حاجة لطبقة أساس أو تحضيرية

source: Strict thickness tolerances and dimensional stability
ar: تحمل سمك صارم واستقرار أبعاد

source: Precise dimensions for accurate laser cutting
ar: أبعاد دقيقة للقطع بالليزر المضبوط

source: Carefully selected solid core and face veneers
ar: قشرة اللب الصلب والوجه مختارة بعناية

source: Minimum defects for superior quality
ar: أقل العيوب لجودة فائقة

source: No combustion under laser beam influence
ar: لا احتراق تحت تأثير شعاع الليزر

source: Safe and clean laser cutting process
ar: عملية قطع ليزر آمنة ونظيفة

source: No harmful fumes during cutting process
ar: لا أبخرة ضارة أثناء عملية القطع

source: Clean and safe for operators
ar: نظيف وآمن للمشغلين

source: Available with wire-mesh and hexa-mesh patterns
ar: متوفر مع أنماط الشبكة السلكية والشبكة السداسية

source: Multiple surface texture options
ar: خيارات متعددة لنسيج السطح

source: Suitable for outdoor applications
ar: مناسب للتطبيقات الخارجية

source: Resistance to mechanical damages and chemicals
ar: مقاومة الأضرار الميكانيكية والكيماوية

source: Durable performance in demanding environments
ar: أداء متين في البيئات الصعبة

source: Low formaldehyde emissions
ar: انبعاثات فورمالديهايد منخفضة

source: Pine Lumber
ar: خشب الصنوبر

source: Premium quality pine lumber for construction projects
ar: خشب صنوبر عالي الجودة لمشاريع البناء

source: Premium Pine Lumber
ar: خشب الصنوبر الممتاز

source: Pine Lumber Applications
ar: تطبيقات خشب الصنوبر

source: Natural Strength
ar: القوة الطبيعية

source: Superior structural integrity
ar: سلامة هيكلية فائقة

source: Easy to Work With
ar: سهل التعامل معه

source: Excellent machining properties
ar: خصائص تشغيل ممتازة

source: Sustainable Material
ar: مادة مستدامة

source: Environmentally responsible sourcing
ar: مصادر مسؤولة بيئياً

source: Cost Effective
ar: فعال من حيث التكلفة

source: Excellent value for construction projects
ar: قيمة ممتازة لمشاريع البناء

source: Specification
ar: المواصفة

source: Value
ar: القيمة

source: Premium Pine Wood
ar: خشب الصنوبر الممتاز

source: Construction Grade
ar: درجة البناء

source: Moisture Content
ar: محتوى الرطوبة

source: Dimensions Available
ar: الأبعاد المتاحة

source: Length
ar: الطول

source: 8ft, 10ft, 12ft, 16ft
ar: 8 قدم, 10 قدم, 12 قدم, 16 قدم

source: Treatment
ar: المعالجة

source: Kiln Dried
ar: مجفف بالفرن

source: Residential Construction
ar: البناء السكني

source: Framing, flooring, roofing
ar: الإطارات، الأرضيات، الأسقف

source: Commercial Projects
ar: المشاريع التجارية

source: Structural support, framework
ar: الدعم الهيكلي، الإطار

source: Furniture Making
ar: صناعة الأثاث

source: Tables, chairs, cabinets
ar: الطاولات، الكراسي، الخزائن

source: Decorative Work
ar: العمل الزخرفي

source: Trim, molding, finishing
ar: التشطيب، التشكيل، الإنهاء

source: Why Choose Our Pine Lumber?
ar: لماذا تختار خشب الصنوبر الخاص بنا؟

source: Carefully selected and graded lumber that meets the highest industry standards for strength and durability.
ar: خشب مختار ومتدرج بعناية يلبي أعلى معايير الصناعة للقوة والمتانة.

source: Quick processing and reliable delivery to keep your construction projects on schedule.
ar: معالجة سريعة وتسليم موثوق للحفاظ على مشاريع البناء الخاصة بك في الموعد المحدد.

source: Professional guidance from our experienced team to help you choose the right lumber for your project.
ar: إرشاد مهني من فريقنا ذي الخبرة لمساعدتك في اختيار الخشب المناسب لمشروعك.

source: Ready to Order Pine Lumber?
ar: جاهز لطلب خشب الصنوبر؟

source: Get Quote Now
ar: احصل على عرض سعر الآن

source: Pine Wood Lumber
ar: خشب الصنوبر

source: Pine Wood
ar: خشب الصنوبر

source: Highest quality pine lumber with useful properties. Pine wood is a low density (520kg/m3) and high strength type of wood which is water resistant. It has a high rate of sound insulation, breathability and low electrical conductivity. Pine lumber is easy to treat, with its unified structure and beautiful texture it has high resistance to fracture. Pine wood is totally friendly to the environment and is hypoallergenic.
ar: خشب صنوبر عالي الجودة بخصائص مفيدة. خشب الصنوبر هو نوع من الخشب منخفض الكثافة (٥٢٠ كجم/م³) وقوي يقاوم الماء. له معدل عالي من العزل الصوتي والتهوية والموصلية الكهربائية المنخفضة. خشب الصنوبر سهل المعالجة، وبهيكله الموحد وملمسه الجميل له مقاومة عالية للكسر. خشب الصنوبر صديق للبيئة تماماً وغير مسبب للحساسية.

source: Pine trees are efficient material for construction as they don't require to be dried for a long time and are easy to treat. Applications for pine lumber are: construction of supporting structures, frames, roof systems, piles, interior decoration, walls, doors, frame furniture production, paper industry.
ar: أشجار الصنوبر مادة فعالة للبناء حيث لا تحتاج للتجفيف لفترة طويلة وسهلة المعالجة. تطبيقات خشب الصنوبر هي: بناء الهياكل الداعمة، الإطارات، أنظمة الأسقف، الركائز، الديكور الداخلي، الجدران، الأبواب، إنتاج أثاث الإطارات، صناعة الورق.

source: Density
ar: الكثافة

source: Transport Moisture Content
ar: محتوى الرطوبة للنقل

source: Carpentry Moisture Content
ar: محتوى الرطوبة للنجارة

source: Thickness, mm
ar: السماكة، مم

source: Width, mm
ar: العرض، مم

source: From 3m to 6m (with 30cm step)
ar: من ٣ م إلى ٦ م (بخطوة ٣٠ سم)

source: 520 kg/m³
ar: ٥٢٠ كجم/م³

source: 16-18 percent
ar: ١٦-١٨ بالمئة

source: 10-12 percent
ar: ١٠-١٢ بالمئة
